[
    {
        "title": "NATO is in a race against time to save itself from a major embarrassment?",
        "content": "Both Sweden and its neighbor Finland stated their intent to join NATO through its open-door policy in May last year, just weeks after Russia launched its unprovoked invasion of Ukraine. Finland was finally accepted in April of this year, doubling the alliance’s border with Russia, but Sweden’s accession is currently blocked. It is generally accepted that Sweden’s armed forces are compatible with NATO. Sweden has a permanent delegation at NATO and is considered a close partner to the alliance, meaning joining should be relatively straightforward.",
        "author_id": "1"
    },
    {
        "title": "Hardware and the Metaverse",
        "content": "Hi! The “METAVERSE PRIMER” was published in early 2021, long before “the Metaverse” surged to popularity, or was even mentioned by Mark Zuckerberg (let alone contemplated as the new name for Facebook). The Primer was the third entry in my Metaverse series, which began in 2018, and was intended to share my thinking on the still-inchoate and seemingly far off topic. After publishing the Primer, I decided to write a book on the topic, which was published by Norton more than a year later. The book fully rewrote, revamped, and expanded on all 34,000 words in the Metaverse Primer, which serves as the middle segment of the book. The hardware section, for example, grew from 600 words to 14,000, and a dedicated section on the blockchain was developed. I also added another fully new 70,000 words, which comprise Parts I and III and discuss the history of the Metaverse, providing a detailed definition of it, explaining its origins in gaming, the businesses it will produce, when it might arrive, how it will be regulated, who might lead it, etc.",
        "author_id": "1"
    },
    {
        "title": "Before-and-after images from EarthCam show US landmarks as they get inundated with wildfire smoke",
        "content": "The wildfire smoke that originated from Canada shrouded some major US cities on the Eastern Seaboard, leaving millions at risk of breathing unhealthy air and prompting the cancellation of outdoor activities ranging from school recess to Major League Baseball games. Beyond being a health threat, the smoky skies altered the view of some iconic landmarks, particularly in hard-hit New York City.",
        "author_id": "1"
    },
    {
        "title": "Largest ruby ever to come to auction sells for record-breaking $34.8 million",
        "content": "A 55.22-carat ruby has become both the largest and most valuable gem of its kind ever to sell at auction, netting $34.8 million on Thursday. The stone went under the hammer in New York in June, less than a year after Canadian firm Fura Gems discovered it at one of the company’s mines in Mozambique. Ahead of the sale, Sotheby’s described the jewel as “exceedingly rare” and “the most valuable and important” ruby ever to come to market. It was named Estrela de Fura — or Star of Fura in Mozambique’s official language, Portuguese.",
        "author_id": "1"
    },
    {
        "title": "‘Like entering a forest’: Inside Asia’s largest timber building",
        "content": "Singapore has long billed itself as a “garden city,” a term coined in the 1960s by the country’s founding father and former prime minister, Lee Kuan Yew. In the decades since, the island has embarked on extensive tree-planting programs and embraced so-called “biophilic” architecture, with greenery often seen creeping up urban facades or spilling out from skyscrapers. A new six-story college campus building stands as Singapore’s latest ode to nature. Home to Nanyang Technological University’s (NTU) business school, the gently curved design features sunlit atriums, open-air study areas set against lush backdrops and elevators that descend into beds of tropical plants. Everything from handrails to benches, door frames to room dividers (and even an adjoining bus stop), were built using wood.",
        "author_id": "1"
    }
]
